app/views/posts/index.html.erb

<p><%= post.body %> </p>
<small> <%= post.created_at.strftime("%b %d. %Y") %> </small>
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hello"], ["body", "i am the body"], ["created_at", "2015-07-08 15:25:07.172573"], ["updated_at", "2015-07-08 15:25:07.172573"]]