app/views/posts/new.html.erb

SELECT "categories".* FROM "categories"
---
<p>
  <%= f.select :category_id, Category.all.collect {|x| [x.name, x.id]},  {:include_blank => "select one"} %><br />