app/views/posts/show.html.erb

</br>
<small> <%= @post.created_at.strftime("%b %d. %Y") %> </small>
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hello"], ["body", "i am 1st the body"], ["created_at", "2015-07-08 15:33:15.075695"], ["updated_at", "2015-07-08 15:33:15.075695"]]