app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories"
---
 def new
@post = Post.new
@category = Category.all

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hello"], ["body", "i am 1st the body"], ["created_at", "2015-07-08 17:56:21.386707"], ["updated_at", "2015-07-08 17:56:21.386707"]]
---
 def create

   @post =  Post.new(post_params)

      if @post.save